import translators as ts

wyw_text = """　高校生としての二度目の春、新しいクラスでも絶賛ぼっちの俺はいわゆる平凡なオタク高校生だった。



　最近のマイブームといえば異世界転生の小説。



　テンプレだからこその安心感と、テンプレの中に光る作者のオリジナリティを楽しむのが俺流だ。



　とはいえ、諸手を挙げて全肯定というわけでもなく、納得できない部分もある。



　例えば、異世界転移のきっかけとなる魔法陣だ。



　足元に浮かび上がった魔法陣に、主人公たちはなすすべなく転移させられてしまうわけだが……。



　え、避けれるよね？



　逃げたらいいじゃない？



　設置式魔法陣なんてちょっと動けば範囲外。



　教室をカバーする大きさでも、二秒あれば窓から飛び出せる。



　そう思っていた時期が俺にもありました。



「どおっせええええい！」



　かけ声一番、机の上に駆け上がりながら必死に跳躍する。



「ちくしょう！ リアル魔法陣とかふざけんなよ！」



　毒づく俺の後ろからは、光り輝く魔法陣が地面を這って追いかけてくる。



「追尾式！？　冗談じゃないぞ！ 速度も速いしそんなの卑怯だろ！？　テンプレはどうした！？」



　追尾式魔法陣などというテンプレキラーな反則技に追い立てられる俺の姿を、クラスメイトたちはぽかんと口を開けて見ていた。



「絶対に嫌だ！　魔王退治とか無理！ 絶対にむりむりむーりー！」



　俺は消費する側のオタクである。



　体力など皆無。ついでにコミュ力も皆無。



　そんな人間が異世界で仲間たちとパーティー組んで魔王退治とか絶対に無理だ。



　だが、そんな俺の願いもむなしく、目の前には行き止まりの黒板が迫っていた。



　後ろには魔法陣、前には黒板、退路は右の戸口か、左の窓か。



「どっちだ！？」



　素早く右を向いて障害物を確認、戸口にはヤンキーとギャルがたむろしていた。



　即決。右は無理。



　オタクの天敵の群れに飛びこむことはできない。



　我、進軍は不可能と判断す！



　戦略的撤退を敢行すべし！



　俺は即座に左に飛んだ。



「あっ」



　後悔先に立たず。



　そこにはクラス一の不思議美少女、音無おとなし柑奈かんなさんが優雅に佇んでいらっしゃったのである。



「よ、よけてぇぇぇぇぇぇっ！」



「むり」



「冷静！？」



　意外と冷静な音無さんを巻きこんで、俺たちは盛大に地面を転がった。



「いったぁ……って、やばい！ 魔法陣が……っ！」



　はっと我に返るが時すでに遅し。



　俺と音無さんの足元には、魔法陣が小憎らしく燦然と煌めいていた。



「ちっくしょう……！」



　そして、俺と音無さんは光の爆発に飲みこまれた。







　◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆◇◆　







　目が覚めてみれば案の定、夢落ちはなかった。



　周りには漫画やアニメでしかお目にかかったことのないアラビアンな宮殿が広がっている。



　玉座と思しき豪華な椅子に座った女性が、妖艶な笑みを浮かべていた。



「こんにちは、神様」



「ふはっ。肝っ玉がでかい小僧じゃのう。いかにも、我は創造八神が一柱、ユメリアじゃ」



　ユメリアと名乗った女性は露出度の高い豪奢な衣装に身を包んでいた。



　純粋培養のＤＴドーテーにはいささか刺激が強い。



「さてさて、肝が据わっておるのは良いことじゃが、突然で説明が欲しいじゃろう。まずは説明するゆえ、後ろのそなたともども座るがよいぞ」



　後ろのそなたと言われ、俺は物凄く嫌な顔をしながら振り返った。



「だってよ、音無さん」



「こくり」



　頷いたのは音無さんである。



　なんとなく予想していたが、やっぱり異世界召喚に巻き込んでいたようだ。



　音無さんは端的に言って文句なしの美少女だ。



　身長は俺より頭一つ分小さく、引き締まった体はスポーティに見える。



　ぽってりとした唇と、しゅっとした顎のラインのバランスが秀逸で、おかっぱボブの黒髪と白い肌が印象的だった。



　俺はごくり、と喉を鳴らしながら音無さんの目を観察する。



（よし、大丈夫だ。怒ってないぞ……）



　いまいち何を考えているかわかりづらい天然系不思議ちゃんの音無さんだが、怒っている時はとてもわかりやすい。



　普段は半眼で眠そうな目は愛嬌があって可愛らしいのだが、一度スイッチが入ると一気に目力が増すのだ。



　睨むだけで人を殺せると噂の、処刑人の目になってしまうのである。



「えっと、音無さん？」



「かくん？」



　音無さんは不思議そうにこちらを見つめながら首を傾げた。



　その様子にユメリアも首を傾げた。



「なんじゃ、そのこくりだの、かくんだのは……その娘は何を言っておるんじゃ？」



「あーこれはその……彼女、自分で擬音を言っちゃう系の不思議ちゃんなんで……」



　俺は音無さんを振り返り、念のため確認した。



「音無さん、怒ってないよね？」



「こくり」



「とりあえず座る？」



「こくり」



「……ええと、レディーファースト？」



「こくり」



（やりづれえええぇぇぇぇぇぇっ！！！！）



　魂の叫びを必死に押し殺し、俺も音無さんの横に座る。



　そうしてやっとユメリアが話してくれたのは、俺の予想とはちょっと違う内容だった。



　曰く。



　異世界転生ではない。



　俺はもともとユメリアの世界の住人だったが、ユメリアのミスで輪廻の輪を外れて地球世界に紛れ込んでいたらしい。



　よって俺は異世界転生ならぬ、元世界転生を果たすわけだ。



　ユメリアのミスが発端ということで、生まれる先は王子であり、生前の善行で得られるスキルも特別大ボーナスだそうだ。



「問題はそなたよ、女」



「かくん？」



　神様相手でもいつも通りの音無さんに、ユメリアは悩むように天井を仰ぎ、小さく息を吐いた。



「よりにもよって、あの頭でっかちの民をさらうなど面倒事の予感しかせぬわ……とはいえ、来てしもうたものはしようがない。お主は我の民ではないゆえ、元の世界に戻す。準備にざっと百年かかるから、それまではこの世で暮らせ」



「こくり」



「即答！？　本当にいいの！？」



　頭を抱える俺をよそに、音無さんは平然としていた。



「よろしい。それではスキルの付与じゃ」



（やばい、集中しないと。ここでハズレを引くのはまずいぞ）



　異世界に渡るのが確定事項なら、できるだけ楽に生きたい。そのためには強スキルは必須である。



「それ、好きに選ぶがよいぞ」



　ユメリアはそう言うと、指をぱちりと鳴らした。



　それを合図に、周囲の壁が消えた。



　次いで、地平線まで続くような本棚が現れた。



　世界の果てまで続いているのではと錯覚するほど大量の棚、棚、棚だ。



　そのすべてにぎっしりと本が詰められている。背表紙に【剣術】【槍術】と記載されたその本を手にすればスキルが手に入るらしい。



「って、多くない？　ここから探すの！？」



　ユメリアはやれやれと首を振った。



「自分が望む未来を思い描き、手を伸ばせ。それでお前の望みに相応しいスキル手に入るようになっておる。自分で探すのも良いが、それは世界から針を探すようなものじゃぞ」



「規模がでかすぎるぅー」



　砂漠じゃなくて世界ときた。



　絶対無理なやつだ。



　当然、俺は楽なほうを選ぶことにした。



（さて、俺の望みに相応しい物が手に入るとか言ってたな。俺の望み、俺が欲しい物……うーん何かな。力は必須として……剣かな。できれば聖剣がいいな、かっこいいし。あとは……魔法？　父さんと母さんから叩き込まれた物づくりとか料理とか、家事系は自分でできるし……）



　そこまで考えて、俺の頭に彗星のごとく現れたのは一つの願望だった。



「俺、彼女欲しい」



　ユメリアはかわいそうな眼差しで俺を見る。



「直球じゃの。まあ、お主これっぽっちもモテておらんかったようじゃしな」



「ほっといてください！？」



「いや、褒めておるんじゃぞ。お主のモテなさぶりは筋金入りじゃ。むしろ女難と言えるな。我の世界にいたころから死因はすべて女絡み、たった百年の異世界放浪で五回も死んでおる。それも毎回童貞じゃ。これはもう一種の呪いじゃのう」



「ふぐうぅぅぅっ」



　地面に崩れ落ち、俺は込み上げる涙に視界を歪ませた。



「そんな人生あんまりだよ……俺だって女の子にめちゃモテたい！　異世界なんだから俺を愛してくれる女の子がいたっていいじゃない！　ケモノっ子とかさ！　悪魔っ子とかさ！　もう人間とか贅沢言わないから……あ？」



　叫びを止めたのは、脳内に響く無機質な女性の声だった。



【受理されました。スキルが付与されます】



「え、ちょ、マジで！？」



　マジらしい。



　本棚から飛び出した本たちが俺の周りをくるくると回り始めた。



【超級スキルを獲得しました。スキル名：聖剣の担い手】

【超級スキルを獲得しました。スキル名：愛の狩人（特殊）】

【上級スキル……善行が足りません。下級スキルで代替します】

【下級スキルを獲得しました。スキル名：四源魔法】

【下級スキルを獲得しました。スキル名：製作】

【下級スキルを獲得しました。スキル名：調理】

【下級スキルを獲得しました。スキル名：裁縫】

【下級スキルを獲得しました。スキル名：洗濯】



「うおぉぉっ凄いの来た！ 聖剣の担い手？ 愛の狩人！？ たぎってくるぅぅぅっ」



　後半いまいちわからないものが並んでいるが、前半の凄さですべて良しだ。俺のオタク心はすべて納得して大喜びだ。



　飛び跳ねる俺を尻目に、ユメリアは音無さんに視線を向けた。俺も慌てて姿勢を正す。



「そなたの番じゃぞ」



「こくり」



　だが、さすが音無さんクオリティ。



　手を伸ばすことなく背表紙を一冊一冊確かめながら本棚の間を歩き始める。



「ちょ、ちょっと、どこ行くの？　欲しいスキルを願えば自動的に出てくるよ！？」



　だが、音無さんはこともなげに言った。



「自分で探す」



「え、ええええぇぇぇ……？」



「まあ、それもよいじゃろう。どうせ一日二日であきらめると思うがの……というわけでお主はもう用事は済んだな。あやつは後で送るゆえ、お主は先に行けい」



「は？」



　ユメリアが手を振ると、俺の足元に見慣れた魔法陣が現れた。



「え！？　もう！？」



「当たり前じゃろうが」



「こ、心の準備とか、色々……！」



　ユメリアは意地の悪い笑みを浮かべる。



「当たって砕けろじゃ。頑張れ、王子殿」



「く、くっそおおぉぉぉぉぉぉっ！？」



　そして、俺の意識は光に飲まれ……目が覚めた時、俺は王子だった。"""
print(ts.bing(wyw_text, if_use_cn_host=False,from_language='ja',to_language='zh-CN'))
# print(ts.youdao(wyw_text, sleep_seconds=5, proxies={}, use_cache=True,from_language='ja',to_language='zh'))
# help
# help(ts.deepl)